# 2. Даны действительные числа x и y. Получить (|x| - |y|) / (1 + |xy|)


x = -12
y = 4

c = (abs(x) - abs(y)) / (1 + abs(x * y))

print(c)
