# Даны два де ствительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел.


number_1 = 12
number_2 = 4

average = (number_1 + number_2) / 2
geometric = pow(number_1 * number_2, .5)

print('Среднее арифметическое =', average)
print('Среднее геометрическое =', geometric)
