# Создать строку равную первым пяти символам введенно строки.


string = input('Введите строку: ')

new_string = string[0:5]

print(new_string)
