# Дана длина ребра куба. Найти объем куба и площадь его боково поверхности.


dl = 4

volume = pow(dl, 3)
square = pow(dl, 2)

print('Объем куба =', volume)
print('Площадь боковой поверхности =', square)
