# Создать строку равную третьему символу введенной строки.


string = input('Введите строку:')
new_string = string[2]

print(new_string)
