# Создать строку равную предпоследнему символу введенно строки.


string = input('Введите строку: ')

new_string = string[len(string) - 2]

print(new_string)
